Revit 2027 API
IFCUserDefinedPropertySet.GetProperties Method
 Returns the collection of properties in the property set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<IFCUserDefinedProperty> GetProperties()
Public Function GetProperties As IList(Of IFCUserDefinedProperty)
public:
IList<IFCUserDefinedProperty^>^ GetProperties()
member GetProperties : unit -> IList<IFCUserDefinedProperty>
Return Value
IList<IFCUserDefinedProperty>
 The collection of properties in the property set.
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace